trade_exp/src/Documents/СторнированиеУдержаний/СторнированиеУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c15acf72-b338-43aa-a7ed-b97ab7a032c1">
  <name>СторнированиеУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ddce69f3-d439-457b-985b-b13bc9d2ab08">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d98ceadd-9f7a-4c70-9171-23bfbf73f50c">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3f2f69c-7788-441f-9c20-e42f7084088c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="e5ef9eb7-0c26-4ac3-a8fa-94556096b017">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="56162c02-9d7f-492d-b6e5-de78f35be961">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca6dbefb-30db-412a-96e5-d8597c8c6828">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12f96126-c4de-450e-a5c8-1080131990c9">
      <name>СуммаЗадержки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ffa45e09-552d-4292-a7d3-a9ec51019b8c">
      <name>СуммаУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e3a78b7b-5f85-4823-8d94-013e35409c44">
      <name>СуммаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf8d7595-e920-4e03-b44d-b47abdc1fd8d">
      <name>СуммаСторно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9422854c-d16a-478d-a9ac-cabf2f30c358">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/НачисленияУдержаний/НачисленияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cb276f85-23f2-4f34-b5ad-8ff4958f4b48">
  <name>НачисленияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="a8a6f686-64bf-486f-878a-3a2d11d1ea5a">
    <name>СуммаЗадержки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7fcb5e70-0a78-4965-ac0e-da25b7f35f36">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9eb43b5e-6086-4599-a2ee-f1b93f27250d">
    <name>СуммаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fc07c14a-9677-45ed-a7f3-c48d32cfeeee">
    <name>СуммаСторно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="92b35696-bc4b-4e39-baf2-792c4df395c3">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="1a2b70d4-deac-4462-b1b6-dd336507cf52">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2be42aa7-4d0f-4215-8085-021885108398">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7bfc9cfa-618d-41a7-a85f-18574af79ef9">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6e85eda3-b516-437b-96b7-6bdaadc191cf">
    <name>РегистраторУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/СторнированиеУдержаний/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Печать
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//-

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры


&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления = НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСторно(Команда)
	ЗаполнитьСторноНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСторноНаСервере()
	ЗаполнитьУдержания();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУдержания()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Сотрудник
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(НачисленияУдержанийОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
		|	СУММА(НачисленияУдержанийОбороты.СуммаУдержанияОборот) КАК СуммаУдержания,
		|	СУММА(НачисленияУдержанийОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
		|	СУММА(ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаЗадержкиОборот, 0) - ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаВозвратаОборот, 0)) КАК СуммаСторно,
		|	ВТ.Сотрудник КАК Сотрудник,
		|	НачисленияУдержанийОбороты.Удержание,
		|	НачисленияУдержанийОбороты.РегистраторУдержания КАК РегистраторУдержания
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержаний.Обороты(
		|				,
		|				,
		|				,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТ.Сотрудник
		|					ИЗ
		|						ВТ КАК ВТ)) КАК НачисленияУдержанийОбороты
		|		ПО ВТ.Сотрудник = НачисленияУдержанийОбороты.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Сотрудник,
		|	НачисленияУдержанийОбороты.Удержание,
		|	НачисленияУдержанийОбороты.РегистраторУдержания
		|
		|ИМЕЮЩИЕ
		|СУММА(НачисленияУдержанийОбороты.СуммаСторноОборот) <> СУММА(ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаЗадержкиОборот, 0) - ЕСТЬNULL(НачисленияУдержанийОбороты.СуммаВозвратаОборот, 0))";
	
	Запрос.УстановитьПараметр("ТЗ", Объект.Начисления.Выгрузить(,"Сотрудник"));
	//Запрос.УстановитьПараметр("Удержание", ТекущиеДанные.Удержание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Начисления.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
